
#Область ПрограммныйИнтерфейс

Функция ЗначениеКонстанты(ИмяКонстанты, ИспользоватьПовтИсп, ПолучатьДанныеХранилища = Ложь) Экспорт	
	
	Если ИспользоватьПовтИсп Тогда
		ЗначениеКонстанты = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты(ИмяКонстанты, ПолучатьДанныеХранилища);
		
	Иначе
		ЗначениеКонстанты = ОбщегоНазначения.ЗначениеКонстанты(ИмяКонстанты, ПолучатьДанныеХранилища);		
		
	КонецЕсли; 
	
	Возврат ЗначениеКонстанты;
	
КонецФункции

Процедура ЗаписатьКонстанту(ИмяКонстанты, Значение, ВХранилище = Ложь, ОбновитьПовтИсп = Ложь) Экспорт
	ОбщегоНазначения.ЗаписатьКонстанту(ИмяКонстанты, Значение, ВХранилище, ОбновитьПовтИсп);	
КонецПроцедуры 

#КонецОбласти 
