
#Область ПрограммныйИнтерфейс

// Упрощенный конструктор описания типа
//
// Параметры:
//  ИмяТипа - Строка, Массив элементов типа "Тип" - первый параметр конструктора ОписаниеТипов()
//  п1 - Произвольный, первый параметр квалификатора
//  п2 - Произвольный, второй параметр квалификатора
//  п3 - Произвольный, третий параметр квалификатора
//
// Возвращаемое значение:
//  ОписаниеТипов
//
Функция ОписаниеТипа(ИмяТипа, п1 = Неопределено, п2 = Неопределено, п3 = Неопределено) Экспорт

    Перем Результат;

    Если ИмяТипа = "Строка" Тогда

        п1 = ?(п1 = Неопределено, 0, п1);
        Если п2 = Неопределено Тогда
            п2 = ДопустимаяДлина.Переменная;
        КонецЕсли;

        КвалСтроки = Новый КвалификаторыСтроки(п1, п2);
        Результат = Новый ОписаниеТипов(ИмяТипа, , , , КвалСтроки);

    ИначеЕсли ИмяТипа = "Число" Тогда

        п1 = ?(п1 = Неопределено, 0, п1);
        п2 = ?(п2 = Неопределено, 0, п2);
        Если п3 = Неопределено Тогда
            п3 = ДопустимыйЗнак.Любой;
        КонецЕсли;

        КвалЧисла = Новый КвалификаторыЧисла(п1, п2, п3);
        Результат = Новый ОписаниеТипов(ИмяТипа, , , КвалЧисла);

    ИначеЕсли ИмяТипа = "Дата" Тогда

        Если п1 = Неопределено Тогда
            п1 = ЧастиДаты.ДатаВремя;
        КонецЕсли;

        КвалДаты = Новый КвалификаторыДаты(п1);
        Результат = Новый ОписаниеТипов(ИмяТипа, , , , , КвалДаты);

    Иначе
        Результат = Новый ОписаниеТипов(ИмяТипа);
    КонецЕсли;

    Возврат Результат;

КонецФункции

// Универсальная функция для парсинга строк
//
// Параметры:
//  ИсходнаяСтрока - Строка
//  СтрокаРазделитель - Строка
//  ОбрезатьПробелы - Булево
//
// Возвращаемое значение:
//  СтруктураЧастиСтроки - Структура
//   * Левая - Строка - Левая часть строки (до начала СтрокаРазделитель)
//   * Правая - Строка - Правая часть строки (после окончания СтрокаРазделитель)
//   * Разбито - Булево - флаг указывающий что в исходной строке есть СтрокаРазделитель
//
Функция РазбитьСтроку(ИсходнаяСтрока, СтрокаРазделитель, ОбрезатьПробелы = Истина) Экспорт

    поз = СтрНайти(ИсходнаяСтрока, СтрокаРазделитель);
    ДлинаРазделителя = СтрДлина(СтрокаРазделитель);
    Разбито = поз > 0;
    ЛеваяЧастьСтроки = Лев(ИсходнаяСтрока, поз - 1);
    Если ОбрезатьПробелы Тогда
        ЛеваяЧастьСтроки = СокрЛП(ЛеваяЧастьСтроки);
    КонецЕсли;

    ПраваяЧастьСтроки = Сред(ИсходнаяСтрока, поз + ДлинаРазделителя);
    Если ОбрезатьПробелы Тогда
        ПраваяЧастьСтроки = СокрЛП(ПраваяЧастьСтроки);
    КонецЕсли;

    СтруктураЧастиСтроки = Новый Структура("Левая, Правая, Разбито"
    , ЛеваяЧастьСтроки
    , ПраваяЧастьСтроки
    , Разбито);

    Возврат СтруктураЧастиСтроки;

КонецФункции

#КонецОбласти
