
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СловаИсключенияПриПроверкеОрфографии = НастройкиПрограммыКлиентСервер.СловаИсключенияПриПроверкеОрфографии();
	ОТВ = НастройкиПрограммыКлиентСервер.ОформлениеТекстаВопросов();
	ОформлениеТекстаВопросов_Шрифт = ОТВ.Шрифт;
	ОформлениеТекстаВопросов_МеждустрочныйИнтервал = ОТВ.МеждустрочныйИнтервал;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.Получить(ИндексТекСтраницы);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначения.ЗаписатьКонстанту("СловаИсключенияПриПроверкеОрфографии", СловаИсключенияПриПроверкеОрфографии, Истина);

	ОТВ = НастройкиПрограммыКлиентСервер.ОформлениеТекстаВопросов();
	ОТВ.Шрифт = ОформлениеТекстаВопросов_Шрифт;
	ОТВ.МеждустрочныйИнтервал = ОформлениеТекстаВопросов_МеждустрочныйИнтервал;
	ОбщегоНазначения.ЗаписатьКонстанту("ОформлениеТекстаВопросов", ОТВ, Истина);

	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ИндексТекСтраницы = Элемент.ПодчиненныеЭлементы.Индекс(ТекущаяСтраница);
КонецПроцедуры

#КонецОбласти
