#Область ПрограммныйИнтерфейс

Процедура ОформитьВопрос(ФорматДокумент) Экспорт
	
	НастройкиОформления = НастройкиПрограммыКлиентСервер.ОформлениеТекстаВопросов();
	
	Для каждого Закладка Из ФорматДокумент.Элементы Цикл
		Закладка.МеждустрочныйИнтервал = НастройкиОформления.МеждустрочныйИнтервал;
		Для каждого Элем Из Закладка.Элементы Цикл
			Если ТипЗнч(Элем)= Тип("ТекстФорматированногоДокумента") Тогда
				Элем.Шрифт = Новый Шрифт(Элем.Шрифт, НастройкиОформления.Шрифт.Имя);					
			КонецЕсли; 			
		КонецЦикла; 
	КонецЦикла; 	
		
КонецПроцедуры
 
#КонецОбласти 