////////////////////////////////////////////////////////////////////////////////
// Конфигурация "Самоконтроль"
// Авторское право (с) 2021, Уничкин Р. А.

// Разрешается повторное распространение и использование как в виде исходника так и в двоичной форме,
// с модификациями или без, при соблюдении следующих условий:
// - При повторном распространении исходного кода должно оставаться указанное выше уведомление об авторском
//   праве, этот список условий и нижеследующий отказ от гарантий.
// - При повторном распространении двоичного кода должно воспроизводиться указанное выше уведомление об
//   авторском праве, этот список условий и нижеследующий отказ от гарантий в документации и/или в других
//   материалах, поставляемых при распространении.
//
// ЭТО ПРОГРАММА ПРЕДОСТАВЛЕНА БЕСПЛАТНО ДЕРЖАТЕЛЯМИ АВТОРСКИХ ПРАВ И/ИЛИ ДРУГИМИ СТОРОНАМИ "КАК ОНА ЕСТЬ"
// БЕЗ КАКОГО-ЛИБО ВИДА ГАРАНТИЙ, ВЫРАЖЕННЫХ ЯВНО ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ,
// ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ. НИ В КОЕМ СЛУЧАЕ,
// ЕСЛИ НЕ ТРЕБУЕТСЯ СООТВЕТСТВУЮЩИМ ЗАКОНОМ, ИЛИ НЕ УСТАНОВЛЕНО В УСТНОЙ ФОРМЕ, НИ ОДИН ДЕРЖАТЕЛЬ АВТОРСКИХ
// ПРАВ И НИ ОДНО ДРУГОЕ ЛИЦО, КОТОРОЕ МОЖЕТ ИЗМЕНЯТЬ И/ИЛИ ПОВТОРНО РАСПРОСТРАНЯТЬ ПРОГРАММУ, КАК БЫЛО
// РАЗРЕШЕНО ВЫШЕ, НЕ ОТВЕТСТВЕННЫ ПЕРЕД ВАМИ ЗА УБЫТКИ, ВКЛЮЧАЯ ЛЮБЫЕ ОБЩИЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ ИЛИ
// ПОСЛЕДОВАВШИЕ УБЫТКИ, ПРОИСТЕКАЮЩИЕ ИЗ ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОГРАММЫ (ВКЛЮЧАЯ,
// НО НЕ ОГРАНИЧИВАЯСЬ ПОТЕРЕЙ ДАННЫХ, ИЛИ ДАННЫМИ, СТАВШИМИ НЕПРАВИЛЬНЫМИ, ИЛИ ПОТЕРЯМИ ПРИНЕСЕННЫМИ ИЗ-ЗА
// ВАС ИЛИ ТРЕТЬИХ ЛИЦ, ИЛИ ОТКАЗОМ ПРОГРАММЫ РАБОТАТЬ СОВМЕСТНО С ДРУГИМИ ПРОГРАММАМИ), ДАЖЕ ЕСЛИ ТАКОЙ
// ДЕРЖАТЕЛЬ ИЛИ ДРУГОЕ ЛИЦО БЫЛИ ИЗВЕЩЕНЫ О ВОЗМОЖНОСТИ ТАКИХ УБЫТКОВ.

#Область ПрограммныйИнтерфейс

// Формат документ заполнен.
//
// Параметры:
//  ФорматДокумент - ФорматированныйДокумент
//
// Возвращаемое значение:
//  Булево
//
Функция ФорматДокументЗаполнен(ФорматДокумент) Экспорт

	Результат = Ложь;
	Если ФорматДокумент <> Неопределено Тогда
		Для Каждого Параграф Из ФорматДокумент.Элементы Цикл
			Для Каждого ЭлемПараграфа Из Параграф.Элементы Цикл
				ТипЭлементаПараграфа = ТипЗнч(ЭлемПараграфа);
				Если ТипЭлементаПараграфа = Тип("ТекстФорматированногоДокумента") Тогда
					Результат = ЗначениеЗаполнено(ЭлемПараграфа.Текст);
				ИначеЕсли ТипЭлементаПараграфа = Тип("КартинкаФорматированногоДокумента") Тогда
					 Результат = Истина;

				КонецЕсли;

				Если Результат Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Результат Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Это новый.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
// Возвращаемое значение:
//
Функция ЭтоНовый(Форма) Экспорт
	Возврат НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка);
КонецФункции

// Элементы формы, подчиненные переданному
//
// Параметры:
//  ЭлементФормы - Произвольный
//  Подчиненные - Массив - служебный
//
// Возвращаемое значение:
//  Массив
//
Функция ПодчиненныеЭлементы(ЭлементФормы, Подчиненные = Неопределено) Экспорт

	Если Подчиненные = Неопределено Тогда
		Подчиненные = Новый Массив;
	Иначе
		Подчиненные.Добавить(ЭлементФормы);
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементФормы, "ПодчиненныеЭлементы") Тогда
		Для каждого ПодчиненныйЭлемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
			ПодчиненныеЭлементы(ПодчиненныйЭлемент, Подчиненные);
		КонецЦикла;
	КонецЕсли;

	Возврат Подчиненные;

КонецФункции

#КонецОбласти
